{
  "id": "https://w3id.org/class/redaktor/temporalCoverage",
  "type": "Concept",
  "followers": "https://test.skohub.io/followers?subject=vocab%2F%2Fw3id.org%2Fclass%2Fredaktor%2FtemporalCoverage",
  "inbox": "https://test.skohub.io/inbox?target=vocab%2F%2Fw3id.org%2Fclass%2Fredaktor%2FtemporalCoverage",
  "prefLabel": {
    "de": "zeitliche Abdeckung",
    "en": "temporal coverage",
    "fr": "couverture temporelle",
    "es": "cobertura temporal"
  },
  "definition": {
    "de": "Der temporalCoverage eines CreativeWorks gibt den Zeitraum an, für den der Inhalt gilt, d. h. den er beschreibt, entweder als DateTime oder als Textstring, der einen Zeitraum im [ISO 8601-Zeitintervallformat] angibt (https://en.wikipedia.org/wiki/ISO_8601#Time_intervals). Im Falle eines Datensatzes wird in der Regel der relevante Zeitraum in einer präzisen Schreibweise angegeben (z. B. würde bei einem Datensatz zur Volkszählung 2011 das Jahr 2011 als \"2011/2012\" geschrieben). Andere Formen von Inhalten, z. B. wissenschaftliche Artikel, Bücher, Fernsehserien oder TVEpisoden, können ihren zeitlichen Geltungsbereich in allgemeinerer Form angeben - in Textform oder über eine bekannte URL.<br> Geschriebene Werke wie Bücher können manchmal auch einen präzisen zeitlichen Geltungsbereich haben, z. B. kann ein Werk, das in den Jahren 1939 bis 1945 spielt, im ISO 8601-Intervallformat durch \"1939/1945\" angegeben werden.<br><br>Offene Datumsbereiche können mit \"..\" anstelle des Enddatums geschrieben werden. Zum Beispiel gibt \"2015-11/...\" einen Bereich an, der im November 2015 beginnt und kein Enddatum hat. Diese Angaben sind vorläufig und werden möglicherweise in Zukunft aktualisiert, wenn die ISO 8601 offiziell aktualisiert wird.",
    "en": "The temporalCoverage of a CreativeWork indicates the period that the content applies to, i.e. that it describes, either as a DateTime or as a textual string indicating a time period in [ISO 8601 time interval format](https://en.wikipedia.org/wiki/ISO_8601#Time_intervals). In the case of a Dataset it will typically indicate the relevant time period in a precise notation (e.g. for a 2011 census dataset, the year 2011 would be written “2011/2012”). Other forms of content e.g. ScholarlyArticle, Book, TVSeries or TVEpisode may indicate their temporalCoverage in broader terms - textually or via well-known URL.<br>      Written works such as books may sometimes have precise temporal coverage too, e.g. a work set in 1939 - 1945 can be indicated in ISO 8601 interval format format via “1939/1945”.<br><br>Open-ended date ranges can be written with “..” in place of the end date. For example, “2015-11/..” indicates a range beginning in November 2015 and with no specified final date. This is tentative and might be updated in future when ISO 8601 is officially updated.",
    "fr": "La couverture temporelle d'un travail créatif indique la période à laquelle le contenu s'applique, c'est-à-dire qu'il décrit, soit sous la forme d'une date et heure, soit sous la forme d'une chaîne de caractères indiquant une période de temps au format [ISO 8601 time interval format] (https://en.wikipedia.org/wiki/ISO_8601#Time_intervals). Dans le cas d'un ensemble de données, il indiquera généralement la période de temps pertinente dans une notation précise (par exemple, pour un ensemble de données sur le recensement de 2011, l'année 2011 sera écrite \"2011/2012\"). D'autres formes de contenu, par exemple un article savant, un livre, une série télévisée ou un épisode d'émission télévisée, peuvent indiquer leur couverture temporelle en termes plus larges - textuellement ou par le biais d'une URL bien connue.<br>Les œuvres écrites telles que les livres peuvent parfois avoir une couverture temporelle précise également, par exemple une œuvre se déroulant de 1939 à 1945 peut être indiquée au format de format d'intervalle ISO 8601 via \"1939/1945\".<br><br>Les plages de dates à durée indéterminée peuvent être écrites avec \"...\" au lieu de la date de fin. Par exemple, \"2015-11/...\" indique une plage commençant en novembre 2015 et sans date finale spécifiée. Ces informations sont provisoires et pourraient être mises à jour à l'avenir lorsque la norme ISO 8601 sera officiellement mise à jour.",
    "es": "La cobertura temporal de un CreativeWork indica el período al que se aplica el contenido, es decir, que describe, ya sea como DateTime o como una cadena textual que indica un período de tiempo en [formato de intervalo de tiempo ISO 8601](https://en.wikipedia.org/wiki/ISO_8601#Time_intervals). En el caso de un conjunto de datos, normalmente indicará el período de tiempo pertinente en una notación precisa (por ejemplo, para un conjunto de datos del censo de 2011, el año 2011 se escribiría \"2011/2012\"). Otras formas de contenido, por ejemplo, ScholarlyArticle, Book, TVSeries o TVEpisode pueden indicar su temporalCoverage en términos más amplios - textualmente o a través de la conocida URL.<br> Las obras escritas, como los libros, a veces también pueden tener una cobertura temporal precisa, por ejemplo, una obra ambientada en 1939 - 1945 puede indicarse en formato de intervalo ISO 8601 a través de \"1939/1945\".<br><br>Los rangos de fechas abiertos pueden escribirse con \"..\" en lugar de la fecha final. Por ejemplo, \"2015-11/..\" indica un rango que comienza en noviembre de 2015 y sin fecha final especificada. Esto es provisional y podría actualizarse en el futuro cuando se actualice oficialmente la norma ISO 8601."
  },
  "notation": [
    "2251"
  ],
  "exactMatch": [
    {
      "id": "schema:temporalCoverage"
    }
  ],
  "inScheme": {
    "id": "https://w3id.org/class/redaktor/scheme",
    "title": {
      "de": "ActivityPub und Freunde - Eine Ontolgie des Fediverse",
      "en": "ActivityPub and friends – An ontology of the fediverse",
      "fr": "ActivityPub et ses amis - Une ontologie du fediverse",
      "es": "ActivityPub y sus amigos - Una ontología del fediverso"
    }
  },
  "@context": {
    "@version": 1.1,
    "id": "@id",
    "type": "@type",
    "@vocab": "http://www.w3.org/2004/02/skos/core#",
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "dct": "http://purl.org/dc/terms/",
    "schema": "http://schema.org/",
    "vann": "http://purl.org/vocab/vann/",
    "as": "https://www.w3.org/ns/activitystreams#",
    "ldp": "http://www.w3.org/ns/ldp#",
    "title": {
      "@id": "dct:title",
      "@container": "@language"
    },
    "description": {
      "@id": "dct:description",
      "@container": "@language"
    },
    "issued": {
      "@id": "dct:issued",
      "@type": "xsd:date"
    },
    "created": {
      "@id": "dct:created",
      "@type": "xsd:date"
    },
    "modified": {
      "@id": "dct:modified",
      "@type": "xsd:date"
    },
    "creator": "dct:creator",
    "publisher": "dct:publisher",
    "preferredNamespacePrefix": "vann:preferredNamespacePrefix",
    "preferredNamespaceUri": "vann:preferredNamespaceUri",
    "isBasedOn": "schema:isBasedOn",
    "source": "dct:source",
    "prefLabel": {
      "@container": "@language"
    },
    "altLabel": {
      "@container": [
        "@language",
        "@set"
      ]
    },
    "definition": {
      "@container": "@language"
    },
    "scopeNote": {
      "@container": "@language"
    },
    "note": {
      "@container": "@language"
    },
    "notation": {
      "@container": "@set"
    },
    "example": {
      "@container": "@language"
    },
    "narrower": {
      "@container": "@set"
    },
    "related": {
      "@container": "@set"
    },
    "relatedMatch": {
      "@container": "@set"
    },
    "narrowerTransitive": {
      "@container": "@set"
    },
    "broaderTransitive": {
      "@container": "@set"
    },
    "broadMatch": {
      "@container": "@set"
    },
    "narrowMatch": {
      "@container": "@set"
    },
    "closeMatch": {
      "@container": "@set"
    },
    "exactMatch": {
      "@container": "@set"
    },
    "followers": "as:followers",
    "inbox": "ldp:inbox",
    "hasTopConcept": {
      "@container": "@set"
    }
  }
}